{
  "name": "Dead Sand Research",
  "icon": "goety:dead_sandstone",
  "category": "goety:crafts",
  "advancement": "goety:goety/craft_dead_sand",
  "sortnum": 7,
  "pages": [
    {
      "type": "patchouli:text",
      "text": "You've come across a text detailing an apocalypse that almost occur several centuries ago. The text talks about a type of sand that would spread across the world by converting certain objects around it. The Dead Sand you now have seems to fit the description of this sand and it seems to share the same properties. Be careful when using placing this down, lest everything will be turn into a desert."
    },
    {
      "type": "patchouli:spotlight",
      "item": "goety:dead_sandstone",
      "text": "However, not every Block is converted to Dead Sand. It seems that in the text, the people constructed a Wall using only Cobblestone and Wooden Planks to halt the spread of the Sands. It also mentions how the Sand doesn't convert non-full blocks."
    },
    {
      "type": "patchouli:text",
      "text": "You found that when an Undead Creature stands upon this odd Sand, they will no longer burn under the heat of the Sun. This also applies to any Undead Minions you've conjured up. In fact, the negative effects of wearing full Necro Robes in daylight are negated when standing on the Sands as well."
    },
    {
      "type": "patchouli:text",
      "text": "Perhaps this Dead Sand can be used to build a new base of operation for yourself, or it can be used for destructive purposes. As for the original Sands, it seems the people of old managed to destroy them all. How, it doesn't specify... for some reason."
    },
    {
      "type": "patchouli:crafting",
      "recipe": "goety:dry_obelisk",
      "text": "You've also discovered a way to speed up the conversion process. By placing this obelisk near Dead Sands, it will cause the sands to convert nearby blocks faster."
    },
    {
      "type": "patchouli:text",
      "text": "However, the obelisk will stop working once enough Dead Sands are near it."
    }
  ]
}